{
    "_name_or_path": "/scratch/gpfs/mengzhou/space2/out/test_round23_mosaicml_version5/llama2_7b_pruning_scaling_doremi_to1.3b_sl4096_finetune_bs1M_fullrun/checkpoint-51200",
    "architectures": [
      "LlamaForCausalLM"
    ],
    "bos_token_id": 1,
    "eos_token_id": 2,
    "hidden_act": "silu",
    "hidden_size": 2048,
    "initializer_range": 0.02,
    "intermediate_size": 5504,
    "max_position_embeddings": 4096,
    "model_type": "llama",
    "num_attention_heads": 16,
    "num_hidden_layers": 32,
    "num_key_value_heads": 16,
    "pad_token_id": 0,
    "pretraining_tp": 1,
    "rms_norm_eps": 1e-05,
    "rope_scaling": null,
    "tie_word_embeddings": false,
    "torch_dtype": "float32",
    "transformers_version": "4.28.0",
    "use_cache": true,
    "vocab_size": 32000
}